name: "AlexNet-Combined-Virtual"

## TOTAL NUM of EXPERTS = 10 ####


##### LMDB Virtual # map Real Class Id to Virtual Class Id #####


layer {
  name: "data"
  type: "MapData"
  top: "data"
  top: "label"
  top: "meta_label" 
  include {
    phase: TRAIN
  }
  transform_param {

    mean_file: "../data/cifar100_mean.binaryproto"
  }
  data_param {
    source: "PATH_TO/train_lmdb"
    batch_size: 100
    backend: LMDB
    labels_map_file: "realVirtualmapping.txt"
   
  }
}



layer {
  name: "data"
  type: "MapData"
  top: "data"
  top: "label"
  top: "meta_label" 
  include {
    phase: TEST
  }
  transform_param {

    mean_file: "../data/cifar100_mean.binaryproto"
  }
  data_param {
    source: "PATH_TO/test_lmdb"
    batch_size: 100
    backend: LMDB
    labels_map_file: "realVirtualmapping.txt"
   
  }
}




# Silence label only in TRAIN phase, because its not used.
# if used remove this silence 
layer {
	name: "sil"
	type: "Silence"
	bottom: "label"	
}



######## Shared conv[1-3] layers  #####



layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 32
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.0001
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "pool1"
  top: "pool1"
}
layer {
  name: "conv2"
  type: "Convolution"
  bottom: "pool1"
  top: "conv2"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 32
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu2"
  type: "ReLU"
  bottom: "conv2"
  top: "conv2"
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "conv2"
  top: "pool2"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv3"
  type: "Convolution"
  bottom: "pool2"
  top: "conv3"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 64
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu3"
  type: "ReLU"
  bottom: "conv3"
  top: "conv3"
}
layer {
  name: "pool3"
  type: "Pooling"
  bottom: "conv3"
  top: "pool3"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 2
  }
}


################################################# Expert_0 #################################
layer {
  name: "conv4_expert0"
  type: "Convolution"
  bottom: "pool3"
  top: "conv4_expert0"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 64
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu4_expert0"
  type: "ReLU"
  bottom: "conv4_expert0"
  top: "conv4_expert0"
}
layer {
  name: "pool4_expert0"
  type: "Pooling"
  bottom: "conv4_expert0"
  top: "pool4_expert0"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 2
  }
}

layer {
  name: "ip1_expert0"
  type: "InnerProduct"
  bottom: "pool4_expert0"
  top: "ip1_expert0"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 64
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "ip2_expert0"
  type: "InnerProduct"
  bottom: "ip1_expert0"
  top: "ip2_expert0"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 10
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}


################################################# Expert_1 #################################
layer {
  name: "conv4_expert1"
  type: "Convolution"
  bottom: "pool3"
  top: "conv4_expert1"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 64
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu4_expert1"
  type: "ReLU"
  bottom: "conv4_expert1"
  top: "conv4_expert1"
}
layer {
  name: "pool4_expert1"
  type: "Pooling"
  bottom: "conv4_expert1"
  top: "pool4_expert1"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 2
  }
}

layer {
  name: "ip1_expert1"
  type: "InnerProduct"
  bottom: "pool4_expert1"
  top: "ip1_expert1"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 64
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "ip2_expert1"
  type: "InnerProduct"
  bottom: "ip1_expert1"
  top: "ip2_expert1"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 10
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}

################################################# Expert_2 #################################
layer {
  name: "conv4_expert2"
  type: "Convolution"
  bottom: "pool3"
  top: "conv4_expert2"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 64
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu4_expert2"
  type: "ReLU"
  bottom: "conv4_expert2"
  top: "conv4_expert2"
}
layer {
  name: "pool4_expert2"
  type: "Pooling"
  bottom: "conv4_expert2"
  top: "pool4_expert2"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 2
  }
}

layer {
  name: "ip1_expert2"
  type: "InnerProduct"
  bottom: "pool4_expert2"
  top: "ip1_expert2"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 64
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "ip2_expert2"
  type: "InnerProduct"
  bottom: "ip1_expert2"
  top: "ip2_expert2"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 10
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}

################################################# Expert_3 #################################
layer {
  name: "conv4_expert3"
  type: "Convolution"
  bottom: "pool3"
  top: "conv4_expert3"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 64
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu4_expert3"
  type: "ReLU"
  bottom: "conv4_expert3"
  top: "conv4_expert3"
}
layer {
  name: "pool4_expert3"
  type: "Pooling"
  bottom: "conv4_expert3"
  top: "pool4_expert3"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 2
  }
}

layer {
  name: "ip1_expert3"
  type: "InnerProduct"
  bottom: "pool4_expert3"
  top: "ip1_expert3"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 64
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "ip2_expert3"
  type: "InnerProduct"
  bottom: "ip1_expert3"
  top: "ip2_expert3"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 10
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}

################################################# Expert_4 #################################
layer {
  name: "conv4_expert4"
  type: "Convolution"
  bottom: "pool3"
  top: "conv4_expert4"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 64
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu4_expert4"
  type: "ReLU"
  bottom: "conv4_expert4"
  top: "conv4_expert4"
}
layer {
  name: "pool4_expert4"
  type: "Pooling"
  bottom: "conv4_expert4"
  top: "pool4_expert4"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 2
  }
}

layer {
  name: "ip1_expert4"
  type: "InnerProduct"
  bottom: "pool4_expert4"
  top: "ip1_expert4"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 64
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "ip2_expert4"
  type: "InnerProduct"
  bottom: "ip1_expert4"
  top: "ip2_expert4"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 10
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}

################################################# Expert_5 #################################
layer {
  name: "conv4_expert5"
  type: "Convolution"
  bottom: "pool3"
  top: "conv4_expert5"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 64
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu4_expert5"
  type: "ReLU"
  bottom: "conv4_expert5"
  top: "conv4_expert5"
}
layer {
  name: "pool4_expert5"
  type: "Pooling"
  bottom: "conv4_expert5"
  top: "pool4_expert5"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 2
  }
}

layer {
  name: "ip1_expert5"
  type: "InnerProduct"
  bottom: "pool4_expert5"
  top: "ip1_expert5"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 64
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "ip2_expert5"
  type: "InnerProduct"
  bottom: "ip1_expert5"
  top: "ip2_expert5"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 10
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}

################################################# Expert_6 #################################
layer {
  name: "conv4_expert6"
  type: "Convolution"
  bottom: "pool3"
  top: "conv4_expert6"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 64
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu4_expert6"
  type: "ReLU"
  bottom: "conv4_expert6"
  top: "conv4_expert6"
}
layer {
  name: "pool4_expert6"
  type: "Pooling"
  bottom: "conv4_expert6"
  top: "pool4_expert6"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 2
  }
}

layer {
  name: "ip1_expert6"
  type: "InnerProduct"
  bottom: "pool4_expert6"
  top: "ip1_expert6"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 64
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "ip2_expert6"
  type: "InnerProduct"
  bottom: "ip1_expert6"
  top: "ip2_expert6"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 10
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}

################################################# Expert_7 #################################
layer {
  name: "conv4_expert7"
  type: "Convolution"
  bottom: "pool3"
  top: "conv4_expert7"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 64
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu4_expert7"
  type: "ReLU"
  bottom: "conv4_expert7"
  top: "conv4_expert7"
}
layer {
  name: "pool4_expert7"
  type: "Pooling"
  bottom: "conv4_expert7"
  top: "pool4_expert7"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 2
  }
}

layer {
  name: "ip1_expert7"
  type: "InnerProduct"
  bottom: "pool4_expert7"
  top: "ip1_expert7"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 64
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "ip2_expert7"
  type: "InnerProduct"
  bottom: "ip1_expert7"
  top: "ip2_expert7"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 10
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}

################################################# Expert_8 #################################
layer {
  name: "conv4_expert8"
  type: "Convolution"
  bottom: "pool3"
  top: "conv4_expert8"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 64
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu4_expert8"
  type: "ReLU"
  bottom: "conv4_expert8"
  top: "conv4_expert8"
}
layer {
  name: "pool4_expert8"
  type: "Pooling"
  bottom: "conv4_expert8"
  top: "pool4_expert8"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 2
  }
}

layer {
  name: "ip1_expert8"
  type: "InnerProduct"
  bottom: "pool4_expert8"
  top: "ip1_expert8"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 64
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "ip2_expert8"
  type: "InnerProduct"
  bottom: "ip1_expert8"
  top: "ip2_expert8"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 10
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}

################################################# Expert_9 #################################
layer {
  name: "conv4_expert9"
  type: "Convolution"
  bottom: "pool3"
  top: "conv4_expert9"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 64
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu4_expert9"
  type: "ReLU"
  bottom: "conv4_expert9"
  top: "conv4_expert9"
}
layer {
  name: "pool4_expert9"
  type: "Pooling"
  bottom: "conv4_expert9"
  top: "pool4_expert9"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 2
  }
}

layer {
  name: "ip1_expert9"
  type: "InnerProduct"
  bottom: "pool4_expert9"
  top: "ip1_expert9"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 64
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "ip2_expert9"
  type: "InnerProduct"
  bottom: "ip1_expert9"
  top: "ip2_expert9"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 10
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}


##########################   Softmax Layer ###########################


layer {
	name: "concat"
	type: "Concat"
	bottom: "ip2_expert0"
	bottom: "ip2_expert1"
	bottom: "ip2_expert2"
	bottom: "ip2_expert3"
	bottom: "ip2_expert4"
	bottom: "ip2_expert5"	
	bottom: "ip2_expert6"
	bottom: "ip2_expert7"
	bottom: "ip2_expert8"
	bottom: "ip2_expert9"
	top: "concat"
	concat_param {
		axis: 1
	}
}


layer {
  name: "loss_combined_virtual"
  type: "SoftmaxWithLoss"
  bottom: "concat"
  bottom: "meta_label"
  top: "loss_combined_virtual"
}



##########################   Accuracy Layers ###########################


layer {
	name: "accuracy_combined_virtual"
	type: "Accuracy"
	bottom: "concat"
	bottom: "meta_label"
	top: "accuracy_combined_virtual"
	include {
	phase: TEST
	}	
}




